IRP/src/Reports/A0014_AccountingPLReport/A0014_AccountingPLReport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
 <name>A0014_AccountingPLReport</name>
</mdclass:Report>

IRP/src/AccountingRegisters/Basic/Basic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
 <name>Basic</name>
 <chartOfAccounts>ChartOfAccounts.Basic</chartOfAccounts>
 <correspondence>true</correspondence>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <balance>true</balance>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Amount</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Quantity</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Quantity</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>CurrencyAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Currency</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
 </resources>
 <attributes>
  <name>Operation</name>
  <type>
   <types>CatalogRef.AccountingOperations</types>
  </type>
 </attributes>
 <attributes>
  <name>IsFixed</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsByRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
</mdclass:AccountingRegister>

IRP/src/Enums/PLSectionTypes/PLSectionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>PLSectionTypes</name>
 <enumValues>
  <name>DataSelection</name>
 </enumValues>
 <enumValues>
  <name>Calculation</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AccountingAnalyticTypes/AccountingAnalyticTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AccountingAnalyticTypes</name>
 <enumValues>
  <name>Debit</name>
 </enumValues>
 <enumValues>
  <name>Credit</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/PLSections/PLSections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PLSections</name>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>SectionType</name>
  <type>
   <types>EnumRef.PLSectionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Order</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Expression</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>250</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SectionName</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Accounts</name>
  <attributes>
   <name>Account</name>
   <type>
    <types>ChartOfAccountsRef.Basic</types>
   </type>
  </attributes>
  <attributes>
   <name>TurnoversType</name>
   <type>
    <types>EnumRef.AccountingAnalyticTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionNumber</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>3</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ExtDimensionValue</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Reports/A0014_AccountingPLReport/Forms/ReportForm/Module.bsl
&AtClient
Procedure Generate(Command)
	GenerateAtServer();
EndProcedure

&AtServer
Procedure GenerateAtServer()
	DataSelectionSections = GetSections(Enums.PLSectionTypes.DataSelection);
	
	Query = New Query();
	Query.SetParameter("Company"    , ThisObject.Company);
	Query.SetParameter("LedgerType" , ThisObject.LedgerType);
	Query.SetParameter("StartDate"  , ThisObject.Period.StartDate);
	Query.SetParameter("EndDate"    , ThisObject.Period.EndDate);
	
	ArrayOfQueryBatches = New Array();
	QueryNumber = 1;
	For Each Row In DataSelectionSections Do	
		For Each AccountsRow In Row.Section.Accounts Do
			ArrayOfQueryBatches.Add(GetQueryText(AccountsRow, QueryNumber));
			
			Query.SetParameter("ExtDimensionFilter" + String(QueryNumber), 
				ValueIsFilled(AccountsRow.ExtDimensionValue));
			Query.SetParameter("ExtDimensionValue" + String(QueryNumber),
			 	AccountsRow.ExtDimensionValue);
			Query.SetParameter("SectionName" + String(QueryNumber),
			 	Row.Section.SectionName);
			Query.SetParameter("Account" + String(QueryNumber),
				AccountsRow.Account);
			Query.SetParameter("TurnoversType" + String(QueryNumber),
				AccountsRow.TurnoversType);
			 	
			QueryNumber = QueryNumber + 1;
		EndDo;
	EndDo;
	
	Query.Text = StrConcat(ArrayOfQueryBatches, Chars.LF + " UNION ALL " + Chars.LF);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	QueryTable.GroupBy("SectionName", "Amount");
	
	Section = New Structure();
	For Each Row In QueryTable Do
		Section.Insert(Row.SectionName, Row.Amount);
	EndDo;
	
	CalculationSections = GetSections(Enums.PLSectionTypes.Calculation);
	
	ArrayOfErrors = New Array();
	SetSafeMode(True);
	For Each Row In CalculationSections Do
		Value = 0;
		If ValueIsFilled(Row.Section.Expression) Then
			Try
				Value = Eval(Row.Section.Expression);
			Except
				ArrayOfErrors.Add(ErrorDescription());
			EndTry;
		EndIf;
		Section.Insert(Row.SectionName, Value);
	EndDo;
	SetSafeMode(False);
	
	For Each Error In ArrayOfErrors Do
		CommonFunctionsClientServer.ShowUsersMessage(Error);
	EndDo;
	
	// output
	ThisObject.DocResult.Clear();
	Template = Reports.A0014_AccountingPLReport.GetTemplate("Template");
	Template.Parameters.Fill(Section);
	ThisObject.DocResult.Put(Template);
EndProcedure

&AtServer
Function GetSections(SectionType)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	PLSections.Ref AS Section,
	|	PLSections.SectionName
	|FROM
	|	Catalog.PLSections AS PLSections
	|WHERE
	|	NOT PLSections.DeletionMark
	|	AND PLSections.SectionType = &SectionType
	|
	|ORDER BY
	|	PLSections.Order";
	
	Query.SetParameter("SectionType" , SectionType);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	Return QueryTable;
EndFunction

&AtServer
Function GetQueryText(AccountsRow, QueryNumber)
	QueryText = 
	"SELECT
	|	SUM(CASE
	|		WHEN &TurnoversType = VALUE(Enum.AccountingAnalyticTypes.Debit)
	|			THEN BasicBalanceAndTurnovers.AmountTurnoverDr
	|		WHEN &TurnoversType = VALUE(Enum.AccountingAnalyticTypes.Credit)
	|			THEN BasicBalanceAndTurnovers.AmountTurnoverCr
	|	END) AS Amount,
	|	&SectionName AS SectionName
	|FROM
	|	AccountingRegister.Basic.BalanceAndTurnovers(BEGINOFPERIOD(&StartDate, DAY), ENDOFPERIOD(&EndDate, DAY),,, Account
	|		IN HIERARCHY (&Account),, Company = &Company
	|	AND LedgerType = &LedgerType
	|	AND CASE
	|		WHEN &ExtDimensionFilter
	|			THEN ExtDimension1 = &ExtDimensionValue
	|		ELSE TRUE
	|	END) AS BasicBalanceAndTurnovers";
	QueryText = StrReplace(QueryText, "&SectionName", "&SectionName" + String(QueryNumber));
	QueryText = StrReplace(QueryText, "ExtDimensionFilter", "ExtDimensionFilter" + String(QueryNumber));
	QueryText = StrReplace(QueryText, "ExtDimensionValue", "ExtDimensionValue" + String(QueryNumber));
	QueryText = StrReplace(QueryText, "&Account", "&Account" + String(QueryNumber));
	QueryText = StrReplace(QueryText, "&TurnoversType", "&TurnoversType" + String(QueryNumber));
	
	If ValueIsFilled(AccountsRow.ExtDimensionNumber) Then
		QueryText = StrReplace(QueryText, "ExtDimension1", "ExtDimension" + String(AccountsRow.ExtDimensionNumber));
	EndIf;
		
	Return QueryText;
EndFunction
